In [10]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import matplotlib.colors as mcolors
from cycler import cycler
import matplotlib.pyplot as plt
import re

In [11]:
temp_df = pd.read_excel('data/Highest temperature on record through 2015 by US City.xlsx')

In [12]:
temp_df

,CITY,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANN
0,"BIRMINGHAM,AL",81,83,89,92,99.0,106,107,105,102,94,85,80,107
1,"HUNTSVILLE,AL",77,83,88,92,96.0,106,105,105,101,91,84,79,106
2,"MOBILE,AL",84,84,89,94,100.0,103,104,105,99,93,87,81,105
3,"MONTGOMERY,AL",83,85,89,94,98.0,105,105,106,101,100,88,85,106
4,"ANCHORAGE,AK",50,49,51,69,77.0,85,84,82,73,64,54,48,85
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
258,"PAGO PAGO- AMER SAMOA,PC",95,96,95,95,93.0,95,91,92,92,94,95,94,96
259,"POHNPEI- CAROLINE IS.,PC",94,96,94,94,94.0,94,95,97,96,95,98,95,98
260,"CHUUK- E. CAROLINE IS.,PC",94,95,96,94,93.0,93,92,96,93,92,91,93,96
261,"YAP- W CAROLINE IS.,PC",94,96,93,96,96.0,97,94,95,96,96,94,94,97
262,"SAN JUAN,PR",92,96,96,97,96.0,97,95,97,97,98,96,94,98

In [13]:
temp_df['STATE'] = temp_df['CITY'].apply(lambda x: x.split(',')[-1])

In [14]:
temp_df

,CITY,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANN,STATE
0,"BIRMINGHAM,AL",81,83,89,92,99.0,106,107,105,102,94,85,80,107,AL
1,"HUNTSVILLE,AL",77,83,88,92,96.0,106,105,105,101,91,84,79,106,AL
2,"MOBILE,AL",84,84,89,94,100.0,103,104,105,99,93,87,81,105,AL
3,"MONTGOMERY,AL",83,85,89,94,98.0,105,105,106,101,100,88,85,106,AL
4,"ANCHORAGE,AK",50,49,51,69,77.0,85,84,82,73,64,54,48,85,AK
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
258,"PAGO PAGO- AMER SAMOA,PC",95,96,95,95,93.0,95,91,92,92,94,95,94,96,PC
259,"POHNPEI- CAROLINE IS.,PC",94,96,94,94,94.0,94,95,97,96,95,98,95,98,PC
260,"CHUUK- E. CAROLINE IS.,PC",94,95,96,94,93.0,93,92,96,93,92,91,93,96,PC
261,"YAP- W CAROLINE IS.,PC",94,96,93,96,96.0,97,94,95,96,96,94,94,97,PC
262,"SAN JUAN,PR",92,96,96,97,96.0,97,95,97,97,98,96,94,98,PR

In [15]:
ann_mean = temp_df.groupby('STATE', as_index=False)['ANN'].agg('mean').reset_index()
print(ann_mean)

index                STATE         ANN
0       0                   AK   87.550000
1       1                   AL  106.000000
2       2                   AR  114.500000
3       3                   AZ  111.750000
4       4                   CA  110.153846
5       5                   CO  103.200000
6       6                   CT  103.000000
7       7                   DC  105.000000
8       8                   DE  103.000000
9       9                   FL  101.666667
10     10                   GA  107.000000
11     11                   HI   94.250000
12     12                   IA  105.500000
13     13                   ID  110.000000
14     14                   IL  106.000000
15     15                   IN  106.750000
16     16                   KS  112.600000
17     17  KWAJALEIN- MARSHALL   97.000000
18     18                   KY  106.500000
19     19                   LA  105.750000
20     20                   MA  101.000000
21     21                   MD  106.000000
22     22                   ME   99.500000
23     23                   MI  102.250000
24     24                   MN  103.200000
25     25                   MO  112.000000
26     26                   MS  107.000000
27     27                   MT  107.142857
28     28                   NC  102.166667
29     29                   ND  108.000000
30     30                   NE  111.142857
31     31                   NH   87.000000
32     32                   NJ  107.000000
33     33                   NM  108.666667
34     34                   NV  108.400000
35     35                   NY  100.333333
36     36                   OH  102.875000
37     37                   OK  113.000000
38     38                   OR  106.375000
39     39                   PA  102.714286
40     40                   PC   96.142857
41     41                   PR   98.000000
42     42                   RI  104.000000
43     43                   SC  106.666667
44     44                   SD  112.000000
45     45                   TN  106.166667
46     46                   TX  111.055556
47     47                   UT  107.000000
48     48                   VA  104.000000
49     49                   VT  101.000000
50     50                   WA  106.333333
51     51                   WI  104.750000
52     52                   WV  100.750000
53     53                   WY  103.000000

In [17]:
ann_mean = temp_df.groupby('STATE', as_index=False)['ANN'].agg('mean')
print(ann_mean)

STATE         ANN
0                    AK   87.550000
1                    AL  106.000000
2                    AR  114.500000
3                    AZ  111.750000
4                    CA  110.153846
5                    CO  103.200000
6                    CT  103.000000
7                    DC  105.000000
8                    DE  103.000000
9                    FL  101.666667
10                   GA  107.000000
11                   HI   94.250000
12                   IA  105.500000
13                   ID  110.000000
14                   IL  106.000000
15                   IN  106.750000
16                   KS  112.600000
17  KWAJALEIN- MARSHALL   97.000000
18                   KY  106.500000
19                   LA  105.750000
20                   MA  101.000000
21                   MD  106.000000
22                   ME   99.500000
23                   MI  102.250000
24                   MN  103.200000
25                   MO  112.000000
26                   MS  107.000000
27                   MT  107.142857
28                   NC  102.166667
29                   ND  108.000000
30                   NE  111.142857
31                   NH   87.000000
32                   NJ  107.000000
33                   NM  108.666667
34                   NV  108.400000
35                   NY  100.333333
36                   OH  102.875000
37                   OK  113.000000
38                   OR  106.375000
39                   PA  102.714286
40                   PC   96.142857
41                   PR   98.000000
42                   RI  104.000000
43                   SC  106.666667
44                   SD  112.000000
45                   TN  106.166667
46                   TX  111.055556
47                   UT  107.000000
48                   VA  104.000000
49                   VT  101.000000
50                   WA  106.333333
51                   WI  104.750000
52                   WV  100.750000
53                   WY  103.000000

In [18]:
ann_mean.reset_index(drop = True)

                  STATE         ANN
0                    AK   87.550000
1                    AL  106.000000
2                    AR  114.500000
3                    AZ  111.750000
4                    CA  110.153846
5                    CO  103.200000
6                    CT  103.000000
7                    DC  105.000000
8                    DE  103.000000
9                    FL  101.666667
10                   GA  107.000000
11                   HI   94.250000
12                   IA  105.500000
13                   ID  110.000000
14                   IL  106.000000
15                   IN  106.750000
16                   KS  112.600000
17  KWAJALEIN- MARSHALL   97.000000
18                   KY  106.500000
19                   LA  105.750000
20                   MA  101.000000
21                   MD  106.000000
22                   ME   99.500000
23                   MI  102.250000
24                   MN  103.200000
25                   MO  112.000000
26                   MS  107.000000
27                   MT  107.142857
28                   NC  102.166667
29                   ND  108.000000
30                   NE  111.142857
31                   NH   87.000000
32                   NJ  107.000000
33                   NM  108.666667
34                   NV  108.400000
35                   NY  100.333333
36                   OH  102.875000
37                   OK  113.000000
38                   OR  106.375000
39                   PA  102.714286
40                   PC   96.142857
41                   PR   98.000000
42                   RI  104.000000
43                   SC  106.666667
44                   SD  112.000000
45                   TN  106.166667
46                   TX  111.055556
47                   UT  107.000000
48                   VA  104.000000
49                   VT  101.000000
50                   WA  106.333333
51                   WI  104.750000
52                   WV  100.750000
53                   WY  103.000000

In [19]:
ann_mean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 54 entries, 0 to 53
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   STATE   54 non-null     object
 1   ANN     54 non-null     float64
dtypes: float64(1), object(1)
memory usage: 3.8+ KB

In [20]:
ann_mean

                  STATE         ANN
0                    AK   87.550000
1                    AL  106.000000
2                    AR  114.500000
3                    AZ  111.750000
4                    CA  110.153846
5                    CO  103.200000
6                    CT  103.000000
7                    DC  105.000000
8                    DE  103.000000
9                    FL  101.666667
10                   GA  107.000000
11                   HI   94.250000
12                   IA  105.500000
13                   ID  110.000000
14                   IL  106.000000
15                   IN  106.750000
16                   KS  112.600000
17  KWAJALEIN- MARSHALL   97.000000
18                   KY  106.500000
19                   LA  105.750000
20                   MA  101.000000
21                   MD  106.000000
22                   ME   99.500000
23                   MI  102.250000
24                   MN  103.200000
25                   MO  112.000000
26                   MS  107.000000
27                   MT  107.142857
28                   NC  102.166667
29                   ND  108.000000
30                   NE  111.142857
31                   NH   87.000000
32                   NJ  107.000000
33                   NM  108.666667
34                   NV  108.400000
35                   NY  100.333333
36                   OH  102.875000
37                   OK  113.000000
38                   OR  106.375000
39                   PA  102.714286
40                   PC   96.142857
41                   PR   98.000000
42                   RI  104.000000
43                   SC  106.666667
44                   SD  112.000000
45                   TN  106.166667
46                   TX  111.055556
47                   UT  107.000000
48                   VA  104.000000
49                   VT  101.000000
50                   WA  106.333333
51                   WI  104.750000
52                   WV  100.750000
53                   WY  103.000000